Revit 2024 API
ConduitSize.InnerDiameter Property
 Inner diameter
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double InnerDiameter { get; }
Visual Basic
Public ReadOnly Property InnerDiameter As Double
	Get
Visual C++
public:
property double InnerDiameter {
	double get ();
}
See Also
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace